Revit 2027 API
ParameterTypeId.MepPreheatHotwaterLoop Property
 "Preheat Hot Water Loop"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId MepPreheatHotwaterLoop { get; }
Public Shared ReadOnly Property MepPreheatHotwaterLoop As ForgeTypeId
	Get
public:
static property ForgeTypeId^ MepPreheatHotwaterLoop {
	ForgeTypeId^ get ();
}
static member MepPreheatHotwaterLoop : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace